src/Catalogs/ЖурналыУчетаКабельнойПродукции/ЖурналыУчетаКабельнойПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЖурналыУчетаКабельнойПродукции</name>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Изм</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.ЖурналыУчетаКабельнойПродукцииПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Трассировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КабельныеЛинии</name>
    <attributes>
      <name>КабельнаяЛиния</name>
      <type>
        <types>CatalogRef.КабельныеЛинии</types>
      </type>
    </attributes>
    <attributes>
      <name>ОткудаПомещение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>199</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОткудаОборудование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОткудаКоординаты</name>
      <type>
        <types>CatalogRef.Координаты</types>
      </type>
    </attributes>
    <attributes>
      <name>КудаПомещение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>199</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КудаОборудование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>199</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КудаКоординаты</name>
      <type>
        <types>CatalogRef.Координаты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаПроектная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаФактическая</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проверена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ЖурналыУчетаКабельнойПродукции/ObjectModule.bsl
#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;			
		
	УдаляемыеКабельныеЛинии = НайтиУдаляемыеКабельныеЛинии();
	
	ОчиститьЖурналКабельныхЛиний(УдаляемыеКабельныеЛинии);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;			

	УстановитьВладелецКабельнымЛиниям();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура УстановитьВладелецКабельнымЛиниям()

	Для Каждого ТекКабельнаяЛиния Из КабельныеЛинии Цикл
		ОбъектЛиния = ТекКабельнаяЛиния.КабельнаяЛиния.ПолучитьОбъект();
		ОбъектЛиния.Владелец = Ссылка;
		ОбъектЛиния.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиУдаляемыеКабельныеЛинии()

	КабельныеЛинииДоУдаления    = Ссылка.КабельныеЛинии;
	КабельныеЛинииПослеУдаления = КабельныеЛинии;
	
	МассивДоУдаления    = КабельныеЛинииДоУдаления.ВыгрузитьКолонку("КабельнаяЛиния");
	МассивПослеУдаления = КабельныеЛинииПослеУдаления.ВыгрузитьКолонку("КабельнаяЛиния");
		
	УдаляемыеКабельныеЛинии = ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивДоУдаления, МассивПослеУдаления);

	Возврат УдаляемыеКабельныеЛинии;
	
КонецФункции

Процедура ОчиститьЖурналКабельныхЛиний(МассивКабельныхЛиний)

	Для Каждого ТекКабЛиния Из МассивКабельныхЛиний Цикл		
		ОбъектКабельнаяЛиния          = ТекКабЛиния.ПолучитьОбъект();		
		ОбъектКабельнаяЛиния.Владелец = Справочники.ЖурналыУчетаКабельнойПродукции.ПустаяСсылка();	
		ОбъектКабельнаяЛиния.ОбменДанными.Загрузка = Истина;	
		ОбъектКабельнаяЛиния.Записать();
	КонецЦикла;		
	
КонецПроцедуры
#КонецОбласти
